dfe-stubs/src/main/resources/wsdl/nfe/ms/hom/event_correction_letter.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is Metro/2.4.3.payara-p3 (2.4.3.payara-maintenance-a5c1c68; 2019-06-17T14:04:38+0200) JAXWS-RI/2.3.2.payara-p2 JAXWS-API/2.3.2 JAXB-RI/2.3.2 JAXB-API/2.3.2 git-revision#unknown. --><!-- Generated by JAX-WS RI (https://github.com/eclipse-ee4j/metro-jax-ws). RI's version is Metro/2.4.3.payara-p3 (2.4.3.payara-maintenance-a5c1c68; 2019-06-17T14:04:38+0200) JAXWS-RI/2.3.2.payara-p2 JAXWS-API/2.3.2 JAXB-RI/2.3.2 JAXB-API/2.3.2 git-revision#unknown. -->
<definitions
        xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"
        xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/"
        xmlns:tns="http://www.portalfiscal.inf.br/nfe/wsdl/NFeRecepcaoEvento4"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/"
        targetNamespace="http://www.portalfiscal.inf.br/nfe/wsdl/NFeRecepcaoEvento4" name="NFeRecepcaoEvento4">
    <types>
        <xsd:schema>
            <xsd:import namespace="http://www.portalfiscal.inf.br/nfe/wsdl/NFeRecepcaoEvento4"
                        schemaLocation="https://hom.nfe.sefaz.ms.gov.br:443/ws/NFeRecepcaoEvento4?xsd=1"/>
        </xsd:schema>
    </types>
    <message name="nfeRecepcaoEvento">
        <part name="nfeDadosMsg" element="tns:nfeDadosMsg"/>
    </message>
    <message name="nfeRecepcaoEventoResponse">
        <part name="nfeResultMsg" element="tns:nfeResultMsg"/>
    </message>
    <portType name="NFeRecepcaoEventoSoap">
        <operation name="nfeRecepcaoEvento">
            <input wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NFeRecepcaoEvento4/nfeRecepcaoEvento"
                   message="tns:nfeRecepcaoEvento"/>
            <output wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NFeRecepcaoEvento4/NFeRecepcaoEventoSoap/nfeRecepcaoEventoResponse"
                    message="tns:nfeRecepcaoEventoResponse"/>
        </operation>
    </portType>
    <binding name="nfeRecepcaoEventoSoap12Binding" type="tns:NFeRecepcaoEventoSoap">
        <soap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="nfeRecepcaoEvento">
            <soap12:operation
                    soapAction="http://www.portalfiscal.inf.br/nfe/wsdl/NFeRecepcaoEvento4/nfeRecepcaoEvento"/>
            <input>
                <soap12:body use="literal"/>
            </input>
            <output>
                <soap12:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="NFeRecepcaoEvento4">
        <port name="nfeRecepcaoEventoSoap12" binding="tns:nfeRecepcaoEventoSoap12Binding">
            <soap12:address location="https://hom.nfe.sefaz.ms.gov.br:443/ws/NFeRecepcaoEvento4"/>
        </port>
    </service>
</definitions>